[{"id": "X6LPJMiNdvQdHAcljhRCnA", "rating": "5.0", "text": "This spot is my go-to.  The service is always incredible... the food is STELLAR... and the ambience is just right.  My fella and I are spoiled in being able walk out 50ft out of our front door, order to go food, sip a cocktail while we wait, and then take the tasty food to our own place when we're feeling like staying in.  BUT, if there's one place I feel like I could really hang at, not feel pushed to rush out the door, and expect service with personality- this is the place.  The Burger and the roasted chicken are our most consistent choices, but we have had every appetizer and salad they offer and have yet to be disappointed.  (Though I swear they used to have red pepper flakes and caraway seeds (?) in their burger patties, and I think they've taken them out. makes sense to offer a neutral burger, but DAMN!  That burger was PERFECT!  I've actually labeled this burger as my favorite burger of all time while describing it in detail to anyone that will listen. it's awesome.)Seriously take the time to check this place out. Local gem.", "category": "\nAmerican (New),\n                    Italian\n", "date": "11/10/2018", "alias": "westcity-sardine-kitchen-seattle", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "XaaY_4FXSVSJDLqUcJKExw", "rating": "5.0", "text": "this place is mine and my husband's go to for inexpensive, awesome take out.  they are always remarkably fast, super kind, and generous with their great selection of housemade salsas.  Their Veggie burrito is .  After all of these years of frequenting this place, I'm finally writing a review because seeing anything below 5 stars for this place is ridiculous!!  YOU GUYS ARE THE BEST!", "category": "\nMexican\n", "date": "9/13/2018", "alias": "taqueria-guaymas-seattle-2", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "wcqxmx_CKGV21BP-A5_-2Q", "rating": "5.0", "text": "This restaurant (and it's attached hotel, of course) are the ONLY reason we frequent Long Beach.  They have a way of leaving us feel so satisfied, pampered, and incredibly impressed.  We have been coming here for years, and can't stop! The views from this restaurant are remarkable, the cocktails are great, and it's rare that you can't get a great seat.  I honestly can't rave enough about this place!  Hit it up!(Oh, AND after reading other reviews complaining about the tipping procedure... yelping about that?!?  really?!?  particularly those that didn't even GO to the restaurant?!?  JESUS!!  are you kidding me?!?  Coming from a server and bartender, I FULLY SUPPORT places that are offering restaurant employees a livable wage.  If you don't support a livable wage for the employees, go make your own food! They damn well deserve it!)", "category": "\nSeafood,\n                    Bars\n", "date": "8/13/2018", "alias": "pickled-fish-long-beach", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "6-WlPMTGQH8bd6_voH-buA", "rating": "5.0", "text": "I went in just to get a gift certificate for a friend (he RAVES about this place!), and I couldn't help but look at the menu after staring at some of the plates as they were being delivered to their respective tables.  needless to say, I had to order something.  mildly overwhelmed by the massive menu, my server was super patient with me and chose the most incredible spicy chicken sandwich for me.  and sweet potato fries, of course.  while I was there, it went from just a couple of tables to a full floor... and the entire time, the servers were so friendly and helpful.  even the kitchen crew was smiling every time I caught their eye (I was sitting at the bar).  the crew seems really happy, which to me says EVERYTHING about a restaurant.  solid spot.", "category": "\nBurgers,\n                    American (Traditional),\n                    Breakfast & Brunch\n", "date": "5/11/2018", "alias": "tonys-burgers-cathedral-city", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "HC5Q_suuZmt1rsGSOD7T5A", "rating": "5.0", "text": "ordered a chicken schwarma to go and was blown away.  the chicken was perfectly seasoned and SO TENDER. incredible food. very flavorful. and walking into the restaurant, I immediately knew I would be back just to hang in that quaint, beautiful space!  love it!", "category": "\nMediterranean\n", "date": "5/11/2018", "alias": "evzin-palm-springs-palm-springs", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "y_JPRRvQ0uJ1epycdCzPVw", "rating": "5.0", "text": "I LOOOOOVE the veggie guaymas burrito... My hubby and I always split one from our local west seattle location.  But when I hit up the Olympus Spa, there is nothing I enjoy more than this veggie packed burrito and the incredibly attentive, friendly service.", "category": "\nMexican\n", "date": "3/14/2017", "alias": "tacos-guaymas-lynnwood-2", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "MGjhdekSjnyYojr_aZZkBA", "rating": "5.0", "text": "WHAAAAAAAT?!?!  This place blew our minds from the start.  So psyched we stopped at Papaya Natural Foods a couple of times, because I don't think we would have noticed this place otherwise... I don't even think there's a sign above the restaurant letting folks know where it is.   But, that doesn't seem to stop it from being nice and full.  ;)This was- HANDS DOWN- our favorite meal of the trip.  The mister got the Ahi Tacos, and we were both BLOWN AWAY by the presentation.  The kitchen is not screwing around.  When they say seared, they mean seared to perfection.  PERFECTION!  The tacos also have this delectable little thin, crispy corn strips as a garnish and, as a crunch-lover, this made me ecstatic!  He was groaning during a good portion of those tacos, stopping only to wash it down with his cerveza.I, on the other hand, almost didn't even TRY his tacos because I was SOOO wrapped up in my Verde Verde Burrito.  Broccoli, green beans and some sort of greens (I can't recall) in a burrito?!?!  Oh, yes.  Indeed.  Sauteed in this spicy chipotle sauce.  DAYUM!!  Such robust flavor!!  MMMMmmmm!  And, I had to order a side of rice and beans, because I'm kindof a freak about my beans (refried, in particular)... and I know this might seem weird, because, to the average joe/jane... how can refried beans be remarkable?  Well, you'll have to ask the kitchen here, because I don't know how they do it!!!  The beans had the most complex, delicious flavor, spiced and salted perfectly.  LOVED IT!!  Service was awesome as well.  We had recently been to a few spots with lame service, so Brittany was a refreshing change of pace... All smiles and so helpful and efficient!  They definitely run a tight ship.", "category": "\nMexican\n", "date": "1/3/2016", "alias": "verde-lihue-4", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "-5KoZDZKCZhyCk0uyFItyQ", "rating": "5.0", "text": "Before getting lost in the delectable food with the unbeatable quality, I really want to give a shout out to the INSANELY AWESOME fella at the counter.  I wish I would've caught his name... but I know was raised in West Seattle, because we were lucky enough to be able to chat with him a bit before the sh*tshow occurred.  Immediately after we ordered, this dude had a straight up CROWD of folks in the store.  If that wouldn't be enough to strip a solo cashier's smile off his face, the phone was also ringing off the hook. It was New Year's Day and maybe this was one of the few places open, but my GOD!  He was working so hard at taking care of each and every person with a massive smile, absolute attention, and without breaking a sweat.  (Note:  I have worked in the restaurant industry for almost 20 years.  This isn't a joke)  I literally contemplated riling up the crowd and trying to get them all to applaud him... but those little scenes typically work out better in my head, so I left it to loudly complimenting him as we left.  ;)OKAY!  So, now onto the food... ha!  We tried four different tacos between the two of us at it was FAR more than we probably needed to eat (they are HUGE), but they were so damn scrumptious that we were even scouring the basket for fallen treasures of our tacos' innards to keep it going!  The kalua pork, the kahuna fish, and this special I can't seem to recall the name of, were unbelievable!  The tortillas were worth writing home about on their own!  GAH!  We also had the seared ahi taco, which I wasn't as big of a fan of, because the ahi didn't really seem seared... it was cooked pretty much all the way through.  But, to their credit, the line was probably working with wide-eyes anticipating the masses of tickets coming their way.  No big deal. And the best part about this all?!?!  The QUALITY!!!  Thankfully, we knew we were supporting some local folks, local farms, and awesome practices.  Our only regret is that we didn't start our trip heading there, and instead wasted our taco taste buds on a few mediocre joints.  At least we know for next time!  ;)", "category": "\nMexican\n", "date": "1/3/2016", "alias": "tiki-tacos-kapaa", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "VJpkARNqdpeWDRwotUwFLw", "rating": "5.0", "text": "So psyched this place is so close to our home!!!  We have only tried the bowls, but really... what else in this world could you need, anyway?  ;)  The food is stellar, the service is always cheerful and knowledgeable.  love, love love!!", "category": "\nCafes,\n                    Juice Bars & Smoothies,\n                    Acai Bowls\n", "date": "1/3/2016", "alias": "fit-bar-superfood-cafe-seattle", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "WufUa-lV8uYYgo9AlWkRNA", "rating": "5.0", "text": "I have absolutely fallen for this place... First off, I have to say- I like brunch.  Whenever I visit Portland, visiting my favorite brunch spots is the first thing on my to-do list.  Well, this spot has changed it all for me.  The last three mornings I spent in Portland, I spent here.  In the sunshine.  Eating these damn acai bowls!  GAH!  There is SO MUCH LOVE put into these bowls.  I have never seen anything like it.  The care, art, and personality these employees put into their creations left me squealing every time.  There is passion here- not only in the quality of the food, but in the quality of preparation.  To the point you get a little embarrassed of being the person taking so many photos of your bowl that the little lady starts to melt a bit.  (That's ok.  I was planning on taking my time with her anyways... ;)  ha!)  Also, mate gourds... you know... just in case you need the full experience.  (and p.s.- the tart, sweet, cool of the bowl vs the bitter heat of the mate is a match made in heaven)The atmosphere inside of the building is just so clean and warm- well lit, fun tunes always playing.  Love it.  AND, as if all of that wouldn't leave you all starry eyed, there is a DONATION BASED YOGA STUDIO attached to the cafe!  GAAAAH!  so, the last day of my visit, timing worked out for me to visit during Richard's Saturday morning class... and what a treat that was!  Really inspiring instruction.  Small studio, but well lit, airy, and bright.   He definitely worked us hard enough that I was drooling by the time I was ordering my bowl.... (clever strategy, gentlemen... VERY clever)  ;)I sincerely look forward to visiting again and again... very soon.", "category": "\nBreakfast & Brunch,\n                    Juice Bars & Smoothies,\n                    Acai Bowls\n", "date": "6/1/2015", "alias": "carioca-bowls-portland-2", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "XLvJQo5g-3jkmh7ovwZ_aQ", "rating": "5.0", "text": "oh my, my, my...  we recently moved to west seattle- me from portland, my boyfriend from edmonds- and we have been aching to find a place that compares with Ken's Artisan Pizza in Portland and Delancey's in Ballard (both of which have been our favorite pizza spots).  And here we are... blessed with not only a comparable pizzeria, but also one just down the street from us.  AND we were lucky enough to get a Groupon for 1/2 off.  Now, my boyfriend and I are both from the midwest, just miles from Chicago... and while we like a deep dish and all, there is something pretty damn delectable about having some choice meats, and some flavorful toppings (fennel, arugula, etc.).  Their pizzas aren't loaded up with cheese, which we appreciate... because it allows you to taste the delicacy of the flavors and the quality without masking it and making your guts ache.  But it's not just the pizzas that are good... the salads are pretty damn tasty themselves. Georgetown Brewing Beers on draft, too.  That pleases the man-friend, indeed. Granted, if you are a Little Caesars/Dominos lover, don't even bother coming in.  This place is for folks that want quality, and appreciate pleasing their palate as opposed to stuffing themselves to the gills.  We have yet to order the pizza to go... so I'm not sure exactly how well they travel... but I will say that the employees there are super attentive and really sweet, so I'm not sure why you'd want to take it to go unless you had to.Another perk?  There aren't TVs everywhere.  It's meant to be a nice dining experience, and the space allows that.  The restaurant is divided by a bar into what my boyfriend and I have coined as the bar tops and the regular dining area.  The bar tops are nice high stools that offer you a pretty choice view of the TV.  It's nice that it's tucked away.  Makes it good for all certain types of occasions.  We are really psyched this is in the hood.", "category": "\nPizza,\n                    Italian\n", "date": "12/17/2013", "alias": "pizzeria-credo-seattle", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "WG2wJIID3buXyvVBdqYbPw", "rating": "4.0", "text": "I have to say, I want to give this place five stars so damn badly because it is, in my humble opinion, precisely what Kenosha could use more of... it's quirky, it's healthy, it's original, it's community oriented... that being said, there are some inconsistencies that I think could use some honing in on...I work in the industry, and notice that the city lacks a bit of the dialed-in service that you can find in other places.  Understandable.  It's a smaller city and everything.  The waitstaff has always been so friendly and courteous.  I think their personalities all seem to be great fits.  Every time I have been in as of yet there is always a little something off- either we don't get our silverware, napkins, water, etc until long after requested (or is \"appropriate\"), or our food is different than we remember/ordered.  This last visit, my mom and I went in for some off their awesome hummus!!  And, it was sad to see the delicious green olives were off the plate and replaced with black olives... :(  just a bummer.  no big deal, really.  there need to be alternations on the menu.  I definitely get that!  The one thing that is challenging is the salad option!  We LOOOVE the concept of creating your own salad with a little fill-in sheet!  We do it nearly every time that we're in.  The salads have always been tasty... the first few times we'd ordered them we never seem to get everything we asked for on the salad.  This last time, they didn't really seem as full and flavorful as we would've hoped.  Mostly, I wasn't into the \"honey mustard\" dressing.... which definitely was made with yellow mustard.  Couldn't get over that.  The small rant aside, I love this place.  I love how warm and welcoming it is, I love the cozy, comfortable spots to sit and chat.  It isn't loud, or full of munchkins.  It is a great spot, with the best tea in town (TRY THE KOKOMATE!!!  WOOHOO!).  If I was still around regularly, it would be the place I studied, ate, drank, etc.  So glad it's been transformed.  And so glad it's in Kenosha!", "category": "\nAmerican (New),\n                    Coffee & Tea\n", "date": "10/21/2013", "alias": "the-good-garden-cafe-kenosha", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "dmjR7BjJVirxJ3KEYpcosg", "rating": "5.0", "text": "little intro on the credibility of this reviewer: I have been receiving bodywork in the form of massage and chiropractic ever since I was a little girl.  Not only have I been in bad car accidents since I was little, I have also suffered from scoliosis and migraines since I was a little lady, so the bodywork has been important to me. I have not only been receiving massage regularly for well over a decade, but I have also attended two bodywork schools, and graduated from Brian Utting School of Massage 8 years ago.   Massage is not a joke to me, and therefore the following statements should not be taken lightly...This place is the jam.I have been a member of Massage Envy for years now.  Due to the fact that I do not have a disposable income, I have leaned on Massage Envy's reasonable rates to receive regular massage.  I am grateful of their rates, but I do notice that at some locations, you receive what you pay for.  Not at West Seattle's location.  This spot is hands down the best Massage Envy in Washington that I've ever been to.  The staff assisted me in finding the perfect deep tissue therapist- Kelsey!!!- and when I called in to get my boyfriend in for a massage because of an injury, they not only found the perfect massage therapist for him, but they were legitimately as thrilled as I was that they managed to book an appointment for both of us at the same time, on the same day, with therapists that would match our needs.  I have been to some great spas and wellness clinics in the NW where I've paid top dollar for bodywork, and these folks at West Seattle M.E. know how to treat you... they care, and it shows!As for Kelsey, she is brilliant.  When I initially walked in to receive deep tissue (I begged the poor girl over the phone to give me a therapist that REALLY did deep tissue), and I saw Kelsey, I kinda chuckled.  I thought, this is going to be interesting... she's so tiny!  BAAAHAHA!  boy, if this wasn't a good ole fashioned lesson in \"don't judge a book by its cover\"...  ;)  I feel like there were just a few moments where she used her hands on my back!  She was elbows all the way!!!  and not in that, \"Thanks for that forearm across my spine\" sorta way... the precision she hones in with her elbow is astonishing!  And when she says she does deep pressure, she is NOT KIDDING!!  this last appointment, she rode my edge for nearly 10 minutes and I can tolerate quite a bit!  She is a really impressive massage therapist, to say the least.  I can't stop singing her praises!My boyfriend went to a massage therapist named Gunner for some injury treatment and deep tissue.  Due to the extent of his injury, Gunner wisely kept a safe distance from it  (We later found out he tore the bicep from the radial attachment.  May need surgery).  Yet, he said Gunner was really great, and he's excited to see him again!  (I will be testing him out in a week and am very excited!!)I am honestly a bit shocked that more people haven't reviewed these folks and offered some opinion on their therapists!", "category": "\nMassage,\n                    Skin Care,\n                    Massage Therapy\n", "date": "10/21/2013", "alias": "massage-envy-west-seattle-seattle-2", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "m0q0MdABUB8_2et53KxSaw", "rating": "5.0", "text": "So, I am taking classes at Cascade next door... Am absolutely starving and refuse (and I mean REFUSE) to eat the vast majority of things the campus offers, so I venture out and I end up here.  I was seriously needing a sandwich, and randomly walked past this place while heading to what I had reluctantly \"settled on\".  I am so glad I did. First off, the service was unbelievable.  Even the guy fixing up the sandwiches in back cheerfully helped the cashier and I figure out the right sandwich for me... And he was sweet enough to offer to make some accommodations due to my love-hate relationship with dairy.  Both were super friendly and helped pick me out the perfect treat.And speaking of that treat... Whew!!  Their BLT (they use spinach!) with a sweet garlic mayo and a cup of their white bean and potato soup.  The sandwich was perfectly toasted and the bread perfectly dressed.  the portions were just right on the sandwich and the soup was full of herbs and tasted so damn good!  And benches outside.  Yup.  In the sun.   (fingers crossed)", "category": "\nDelis,\n                    Sandwiches\n", "date": "4/15/2013", "alias": "south-paw-deli-portland-2", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "-x617nP5QS-umi-e755iLA", "rating": "5.0", "text": "i typically hit up tougo.  no real reason other than their coffee is really tasty.  but today i was hungry, and when i walked in, i saw they were all out of pastries and sandwiches so i headed on down to katy's for the first time in a couple of years... and, wow!  sure, all they had was pastries, but the sweetest, most adorable handle bar mustached barista quietly helped me out... the latte he made was absolutely perfect (and i am a bit of a snob.  i drink soy, and baristas seem to have a problem heating it properly).  but he was a doll!  so glad i came in.  i work down the street and am certain, after my experience with this fella, i will be back again soon!  mmmmm!  :)", "category": "\nCoffee & Tea,\n                    Breakfast & Brunch,\n                    Sandwiches\n", "date": "3/22/2013", "alias": "katys-corner-cafe-seattle", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "b1xsys-3TGYbOEkXR-XpcA", "rating": "5.0", "text": "i strolled in there once based on the inability to choose between sushi or thai (they, proudly, serve both).  i have been craving it ever since.i work on broadway, and when we're busy and starving, we'll call in an order and the delivery driver is so chipper and sweet!  i've been into the establishment a handful of times to dine and to pick up take-out orders.  i recommend chatting with the sushi chef.  he's extremely knowledgeable, and SO proud of the quality of his fish!  he'll be happy to chat with you, and is extremely excited to discuss the wild-caught, seasonal fish options.  PLEASE NOTE:  THE UNAGI IS- WITHOUT A DOUBT- THE BEST UNAGI I HAVE EVER HAD.  EVER.they take their time really crisping up that unagi... its a texture i've never experienced before.  and, unagi is my little weakness... so that's coming from some experienced tastebuds.  one of the times I snuck in there, i had just gotten back from the gym and was starved.  i, without hesitation, ordered three different things off the menu (unagi, tom kha, salmon skin salad), while my date had a curry.  despite the fact that i was starving, i was so astonished by the exceptional flavor of everything, we ended up hanging out there for quite a long time, slowly nibbling on everything... quietly moaning with our eyes shut everytime we took a bite.  it was so phenomenal!  i really recommend testing this place out.  it's definitely my new favorite sushi spot on the hill...", "category": "\nThai,\n                    Sushi Bars,\n                    Japanese\n", "date": "1/18/2011", "alias": "pinto-thai-bistro-and-sushi-bar-seattle", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "FowZ5rrg_qFQ1j28YKQ23Q", "rating": "5.0", "text": "good grief.  i've already spent a solid 50% of my annual earnings on jamaican tempeh wraps and pike street smoothies at hillside quickies.  and now i'm given the option of breakfast, lunch and dinner options at plum, their new sit-down joint.  well, they don't have my smoothies or wraps there, but what DO they have?!?  mac and yease.  yes. yes.  mac and yease- what could, quite possibly be the most excruciatingly delectable mac and cheese (in both the vegan and non-vegan department) i've ever been graced with. the mama africa salad is also an ingenious creation... so perfectly creamy and tangy.  really the perfect compliment to the heavy southern seitan entree. and, while the tiny hillside setting is perfect for some sunny afternoon reading sessions, this new location definitely offers a bit more of an open, airy feel.  i keep bringing friends in, particularly friends that haven't yet converted or widely experienced the vegan options in seattle.  and, even my 3-rare-burgers-a-day boyfriend makes slightly seductive sounds throughout his entire dining experience here.  particularly with the southern seitan platter (which, of course, includes mac and yease).  the servers, overall, are particularly adorable- eager to help you out with your decisions, and obviously very excited about what they're serving.i have literally been there six times in the last two weeks... and while hillside quickies may be missing my business, i've found my new favorite vegan spot....oh!!!  and did i mention its all organic?!?  oh... the comfort....", "category": "\nVegan\n", "date": "9/10/2009", "alias": "plum-bistro-seattle-2", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "PfnvyJP1CSiUFET6NH0fSw", "rating": "5.0", "text": "all right, folks.... all right.yes, i understand that going from zero to four (though number five is currently being built) frozen delectable shops may be a little overwhelming, i would like to clear the air a little on this frozen custard concern.frozen custard is NOT soft serve.  not even close.  this creamy, i'd-like-to-surgically-implant-a-second-stomach-so-i-can-keep-consuming-forever-and-ever dessert is actually made with some egg whites as opposed to simply using cream.  it actually makes it a bit better for you, and a little easier to digest for those of us who shouldn't be doing the dairy thing, but do anyway... because, well... sometimes, the fake s*&t just doesn't cut it.so, with that information in hand, and a lifetime in the frozen custard capital of the world (wisconsin), i walk in, i order multiple dishes to share with co-workers (we have all been gnawing on our fingers in anticipation of its grand opening), and i finish almost two of the dishes while waiting for the others to be finished being made.  (hopefully, they're a bit quicker in their ice-cream scooping/prepping after these last couple of weeks.  initially, the time between ordering and receiving seemed to take a while.  but, that could've been my impatience for getting my first fresh frozen custard in a couple of years....)so, i really dig the cold stone feel of having so many options available to mix in (they have their own version of a blizzard-type of concoction.  always fun...).  and banana splits bring me back to pigtails and skinned knees.... (i'm referring to childhood.  really.)  and, have you ever had a turtle sundae?  jesus.  they even have hot dogs, chili... i have yet to try em.  but, i'll keep you posted... regardless, i love it.  and i'm so excited that we finally have some frozen custard in the area.  if you haven't been there yet, you should definitely get there soon.  and bring a second stomach.", "category": "\nIce Cream & Frozen Yogurt\n", "date": "6/24/2009", "alias": "old-school-frozen-custard-seattle", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "AOpf7FYI_8G91vXIw9AN5A", "rating": "5.0", "text": "On my way to Madison Market the other week, I stumbled across what seemed to be an interesting new shop starting up below one of the 300+ condo developments in the Cap Hill region.  I had been waiting (impatiently) for it to open up, so I could get a better idea of what would be offered at a place that boasts \"vegan, live, organic foods\".  From my understanding, the only thing that comes close to offering a variety of those options on the hill is madison market's deli and raw food section.  I love spots like the chaco canyon in the university district, and there are few things better on a these warm, sunny days than a vegan, raw dish to keep you from passing out from metabolic standstill... within seconds of my first visit, i am eagerly offered a sample of some vegan hemp milk ice cream.  soft serve.  deLICious!  I was too busy perusing around the shops supplements and packaged goods to notice the awesome smoothie options immediately... but now, it's the reason i keep coming back!  Personally, i'm mildly addicted to the acai-oxidant and pomegranate kefir smoothies.  There is also a goji berry smoothie with bananas and bee pollen that's blown not only my mind, but the minds of my fellow co-workers that dine on the smoothies with me as we're opening up our restaurant.  They have a bunch of fresh juice options, too... little concoctions that are meant to focus on enhancing particular functions of the body.  I haven't tried any of them, yet... i'm still too stuck on the smoothies. ha!  maybe in a week or two... The owner is an incredibly sweet guy, too.  seems to love offering samples of the different ice cream toppings (golden berries, goji, cocao nibs-which is my FAVORITE, etc. etc).  I love supporting local businesses.  Particularly when they're just starting out, and they have such a likable person in charge.and, p.s.- i eat the s*&t out of burgers and brie.  i am NO vegan.  and it's STILL an amazing place to snack...", "category": "\nJuice Bars & Smoothies,\n                    Health Markets\n", "date": "5/28/2009", "alias": "healeo-seattle", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "PDqhXVfLszOGt6PJC0ZV0A", "rating": "4.0", "text": "first off, there is nothing that heightened my interest more in this place than all of the negative reviews of the food.  I had to go.  (Thank you, media, for influencing my decision YET AGAIN)So, yes.  it's loud.  cafeteria-style seating. really visually appealing environment.  interesting crowd.  and, though i only tested one thing out on the menu (the roasted beet salad with pear and hazelnuts), i reluctantly dispersed the last of my delectable candied hazelnuts to my inebriated friends, shouting over the noise, \"TRY THIS!  IT'S SOOO GOOD!\"(p.s. they agreed.  i couldn't hear them \"mmmm\", but i did witness the wide-eyed, pleased expressions on their lovely faces)as for drinks, we tried a few of the specialty cocktails.  the bloody sand and the oddfellow.  whew.  three oddfellows later, i'm proud to say i've established a very serious commitment to the cocktail.  the other one was great, as well.  the bloody sand is exactly what you'd name it after the first sip... it's a deep, rich red and sugar textures the beverage to have that pear-like sugary grit to it.  it's delicious.  i have yet to go back to test out more of the food, but i surely will...(p.s.  just revisited for a scone and coffee this morn', and pumped about the orange and currant scone.  closer to a biscuit with its buttery dense texture.  high five #2)", "category": "\nBars,\n                    American (New),\n                    Cafes\n", "date": "3/22/2009", "alias": "oddfellows-cafe-and-bar-seattle", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "6C_lHIrciifcxs3z5W_0ng", "rating": "5.0", "text": "yes.  the wait can be long if you choose to try to hit the place up on a sat or sun \"morning\" (9-11am), but even if you're waiting during that time, they give you the option to a cup of joe.. and half price books has been so kind to let me and my breakfast date peruse the store while waiting for a table... with coffee in hand.  it's actually, just about, the best way to wait for breakfast.  no complaints here.  have you ever had the oatmeal?!?  ok.  well, maybe if you HAD, you'd understand where the wait comes from.  it's magic.  so, i'm convinced that each oat is individually placed in a thimble and cooked to perfection.  there is no other way that i could imagine the creation of that fluffy bowl of goodness.  seriously.  this IS NOT a bowl of mush.  LET ME REPEAT: this is NOT a bowl of mush.  this is the best oatmeal i've ever had.  and, if you order the fruit as a side, not only will you be bouncing up and down on your chair upon its arrival (oh, it's that pretty), but you'll be supplied with enough bananas to turn that oatmeal with butter, raisins, and brown sugar into what feels like dessert.sure, there are other awesome things on the menu.. .particularly the specialty pancakes (they rotate frequently), and the variety of eggs benedict (the californian is my favorite)... but, the oatmeal is why i'm there once a week...", "category": "\nBreakfast & Brunch,\n                    Desserts\n", "date": "3/20/2009", "alias": "glos-seattle", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "FvuiwDBPbM_wzk0IR9CWmg", "rating": "5.0", "text": "mmm. mmm. mmmm.....cry baby?!? legend?!?  blue velvet?!? sixteen candles and say anything?!? old school betty boop cartoons to tide you over while you're waiting for your pitcher of beer to arrive?!? man. good thing they serve beer.  it keeps all of us from being self-conscious sober folks when we've got the urge to belt out the showtunes (king cry baby, anyone?).  The food is pretty tasty.  I love the tapas platter... the kitchen's always switching up the spreads and the roasted veggies.  they just added an apply sage field roast vegan hot dog to their pigs-in-a-blanket list... and that thing is shockingly delicious... (i typically DESPISE field roast... don't ask how i got the courage to test it out... maybe it was the influence of alcohol).  The cafe is also a really adorable place to hangout with the crew after the flick.  Exposed brick and interesting glass milk-bottle lighting really gives the place a cozy feel.  oh.  They have scrabble... enough said.", "category": "\nCinema,\n                    Venues & Event Spaces,\n                    Pizza\n", "date": "3/20/2009", "alias": "central-cinema-seattle", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "LD2WR8ut2giBA4h1bjTFGA", "rating": "5.0", "text": "for a used clothing shop, and for verbally appearing to be so extremely particular with their buy-ins, they sure offer amazing cash and store credit for your clothes.  I had just been into redlight, trying clear my closet of MASSES of clothes... most of which were purchased at anthropologie and redlight... ?.... and redlight barely accepted anything!  (boo.hoo.)  I took my stuff into crossroads, just across the street on broadway, and i ended up with $150 of store credit... have you ever kissed a cashier?  well... it's awkward.so, despite the fact that i could SPEND an easy $500 at redlight in one visit (that's truly the ultimate store on the hill... in my VERY humble opinion.), crossroads is definitely the place to visit when you're looking to spring clean that closet...", "category": "\nUsed, Vintage & Consignment,\n                    Men's Clothing,\n                    Women's Clothing\n", "date": "3/20/2009", "alias": "crossroads-trading-co-seattle", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "DTk2PBkUdIX_WGF45B9gkA", "rating": "4.0", "text": "jesus f&^#ing christ... thank you for your jukebox.  and the brautigan (an amazing whiskey & gingerale beverage)... in a mason jar.  i hate crowds, so you WILL NOT see me there on the weekend evenings, but i do LOVE being able to hang out there in the early eve on the weekdays.  it's mellow.  the decor and dark and woodsy... and the whiskey is plentiful.shit.  yes.  i almost forgot... the food is AMAZING.  yes.  i think i've tried nearly everything on the menu (sweet pot fries, and all kinds of dog varieties).and let the pinball be the cherry on top.", "category": "\nBars,\n                    Burgers\n", "date": "3/20/2009", "alias": "redwood-seattle", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "QumX731cHfsxMUBV4SWVSg", "rating": "5.0", "text": "for the love of all that is good in this world...THANK YOU, thank you, thank you for soy cheese pizzas.  and multi-grain crispy crust.  so, the pizza is pretty expensive.  but, really, what pizza isn't?!?  the farmer's market pizza with multi-grain crust and soy cheese has my tastebuds breaking out in melodic, religious song... broccoli on pizza?  yes, please.  and thank you.  they also serve elliot bay brewery beer (originating in w seattle).  that is my absolute favorite local beer, and it's all organic.  it's so relieving to walk into a place and not have to blind-fold my standards or integrity to crunch and munch on some delicious food.oh.  AND, just about every day of the week, they have an AWESOME special going on... i think mondays are buy one specialty (mine, again is the farmer's market goodness listed above), and you get a large cheese pizza for free.  I love being able to hand off a pizza to a friend after spending a couple of hours there trying to read between stuffing my face with pizza and drowning myself in eb beer.  it's delicious.  really.check it out.  tell me what you think...", "category": "\nPizza\n", "date": "3/20/2009", "alias": "pizza-fusion-seattle-2", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "SdEAHUnFm2s1U7zoHee23Q", "rating": "5.0", "text": "Ok.  first off, my sister and i have been eating there regularly for the last few years.  We recently moved to the pacific northwest, and have been having serious withdrawls. The MANGO CURRY is, without a doubt, the best curry i've ever had.  i'm quite the thai food lover, and i've lived and dined all over the west coast and have never, EVER had curry this perfectly sweet and balanced.  and light!  my stomach often feels a little disrupted by my choice in ethnic foods, but their curry is made with some quality ingredients.   i've been in town three days, and we've already had it for dinner twice!  i don't know how that place isn't always loaded with people.  their recent addition of the sushi bar is awesome!  the sushi's tasty and their soups are pretty good, too.  there used to be a server named ben.  i'm not sure if he's there anymore or not, but he is one of the sweetest, most accomodating servers i've ever been graced with.  all of the servers there are extremely personable and expedite quickly...oh- and their dessert!!  fried bananas please!  SO delicious!  i guess there aren't really many tasty vegan and vegetarian options in this town... and this is always one that i can lean on and know i'm not going to walk away with just lettuce, tomato and a bun in my stomach for \"dinner\".  oh, thai gourmet... what in the h*#% would we do without you?!?", "category": "\nThai\n", "date": "10/28/2008", "alias": "thai-gourmet-llc-kenosha", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}, {"id": "p2O51hTXgCjsbxo8GusVug", "rating": "5.0", "text": "ok.  i may be a moron.  i may not be \"with the times\", but i had no idea there was an option out there to order food for delivery online.  paying online... checking out the menu online... yum. yum. yum.all of that was rather delightful for me.  especially being that i was scouring the delivery vicinity for salmon, and *ta-da* palermo's graced me with the option.so.  i order this baked salmon dish.  and a salad.  i'm pumped.so pumped that i begin cleaning my room, listening to music (apparently) a tad too loud, and all of a sudden, i take a peak at the clock.  anytime now. so, i go to check my phone and see that i have a voice mail from a mysterious number.poor damn delivery driver had called four times... (and left a message saying he'd been ringing the bell for a while)... and now has given up.bummed, i call back immediately.  pissed at myself, and pissed that food was just moments away from being in my grumbling belly- and i f-ed it all up.the man that answered the phone was obviously annoyed, and told me to come grab the goods myself. now i'm shitty, and i can feel my attitude reaching that \"not-so-precious\" place as i'm putting on my shoes and stomp down the stairs.  and then...up pulls a car.  delivery car.  food in hand, this (gorgeous) man walks to me and apologizes.  (apologizes for what?!? right?  i was the moron...)for the love of all that is good is this world... mmm.and for what YOU all care about,  the salmon was unreal.  even the possibility of it being glazed in spit for my dipshit move couldn't of phased this thing... and for, what, $12?, it was amazing.  the salad was lacking a bit in the greens assortment, but i enjoyed it as well.and, i highly recommend the delivery service.", "category": "\nPizza,\n                    Italian,\n                    Mediterranean\n", "date": "4/24/2008", "alias": "palermo-pizza-and-pasta-seattle-2", "user_id": "3KOkOoDT09Gc53SFYEe2gA"}]