[{"id": "W2k6cGSaVRC8TivN-947XA", "rating": "5.0", "text": "Ordered: chocolate coconut scone and a small iced coffeeA few coworkers and I stopped in for an afternoon snack and coffee while visiting the area. This place is very cool, lots of seating in different nooks- I can imagine its a great place for quiet reading or getting work done!Plenty of baked goods options- I will admit it was hard to pick just one treat, if I'm in the area again I will definitely return!", "category": "\nCafes,\n                    Coffee & Tea,\n                    Sandwiches\n", "date": "11/8/2018", "alias": "blue-hat-coffee-coldwater-2", "user_id": "SW89d1F2e_CUUdt6pdDrwQ"}, {"id": "D_-FG7uw3i2Zc-P0of__GA", "rating": "5.0", "text": "If I only had one thing I could say about Brewer's Cabinet:GET THE LOADED TOTS. You won't regret it.I'm not much of a beer fan personally, but I've taken a handful of out-of-towners here that do like beer and this is a great place for it. So many great options to try. Their new Taphouse building next door has a very cool ambiance and they have some pretty great t-shirts/sweatshirts displayed for sale that you can take home with you.If you skimmed over the beginning of this review, and need the cliff notes- GET THE LOADED TOTS!!", "category": "\nComfort Food,\n                    American (New),\n                    Beer Bar\n", "date": "9/10/2018", "alias": "the-brewers-cabinet-reno", "user_id": "SW89d1F2e_CUUdt6pdDrwQ"}, {"id": "V3TCzdPegV-jAN2VQKJWeQ", "rating": "5.0", "text": "I love Surf Thru! One of my co-workers raved about this place and I was hesitant as I live on the north end of town. But it is WORTH the drive. I typically go with the $13 wash- dash wipes, air fresheners, a garbage bag, AND vacuuming included in the price? Sold! Compared to the other car washes I've been to around town- this is without a doubt the best one.", "category": "\nCar Wash\n", "date": "9/10/2018", "alias": "surf-thru-express-car-wash-reno", "user_id": "SW89d1F2e_CUUdt6pdDrwQ"}, {"id": "thasq_Y5TETpNoqRXfFzOQ", "rating": "5.0", "text": "Ordered: Blueberry Gin drink (I LOVED IT!!!!!!)Caesar SaladMargherita PizzaCaramel Coconut CheesecakeOkay, the summer blueberry gin drink- SO TASTY. So refreshing, perfect for summer.Pizza and salad were good, perfect for sharing.The cheesecake is delicious, normally I would've stuffed myself with pizza but I saw this cheesecake and had to have it, make sure to save room- you won't regret it!", "category": "\nPizza\n", "date": "6/15/2018", "alias": "grimaldis-pizzeria-sparks", "user_id": "SW89d1F2e_CUUdt6pdDrwQ"}, {"id": "O55fqjYsgLlg6RRD7Hm4Ww", "rating": "4.0", "text": "Ordered:Sopitas, 1 al pastor and 2 carne asadaOriginal MargaritaThoughts:I love sopes, LOVE them!! Next time I'd probably flip them, get 2 of the al pastor- super tasty!! The margarita is worth the price if you like your margs on the rocks, I prefer blended personally.... still tasty though", "category": "\nMexican\n", "date": "6/15/2018", "alias": "fog%C3%B3n-cocina-mexicana-seattle-2", "user_id": "SW89d1F2e_CUUdt6pdDrwQ"}, {"id": "YlNsImIg6N29jeJqDI57Bg", "rating": "4.0", "text": "Ordered: Mango MojitoBrussels SproutsTruffle FriesSalmon GarganelliThoughts: The mango mojito wasn't my favorite thing, mango pieces in the drink prevented me from drinking it quickly but this was more on me for straying from my typical drink choice- MARGS. Brussels sprouts were AMAZING, so tasty, good crunch and delicious dipping sauce, HIGHLY RECOMMEND (photographed)Got a side of truffle fries per yelp recommendations, next time I'd probably skip it, they weren't anything special I thought, still tasty though if you are craving friesSalmon dish was pretty tasty, I'd get again", "category": "\nAmerican (New),\n                    Italian\n", "date": "6/15/2018", "alias": "westcity-sardine-kitchen-seattle", "user_id": "SW89d1F2e_CUUdt6pdDrwQ"}, {"id": "gyDj-YT9sko-oAfMC48MNg", "rating": "5.0", "text": "Ordered: pork slider, spam musubi, shared fries with friendsThoughts: Beautiful view of the Seattle skyline, perfect place for lunch on a nice day!It was sooo tasty but small portions, one of each made for a good snack but next time I'd probably double up my order to make it more of a meal.", "category": "\nKorean,\n                    Hawaiian,\n                    Asian Fusion\n", "date": "6/4/2018", "alias": "marination-ma-kai-seattle", "user_id": "SW89d1F2e_CUUdt6pdDrwQ"}, {"id": "DFvh_0pmpWQsUL_sahNnzQ", "rating": "5.0", "text": "Ordered: Margarita and Asada SopesThoughts: WOW, margarita was probably the best one I've consumed. And it's on the rocks where I typically order them blended. Very delicious. The sopes were also very tasty, great ratio of everything. I did add some of their mild salsa they provide to give a little extra flavor to some bites.A cool atmosphere in a great location, kind of a small space so maybe not the best for a big group.One thing to note- this is not a typical \"sit down and order restaurant\", you place your order at the counter- which we did not realize until it was too late!  The gentleman working was super accommodating to us out of town folk and still placed our orders at our table, great service, would go back no question", "category": "\nMexican\n", "date": "4/30/2018", "alias": "la-jarocha-portland-2", "user_id": "SW89d1F2e_CUUdt6pdDrwQ"}, {"id": "TiABe4GNA5_exmotusvAOw", "rating": "5.0", "text": "Ordered: Bellini, Portobello Mushroom ScrambleThoughts: Bellini had great flavor, hit the spot!! Mushroom Scramble was amazing, had a little bit of interesting after bite- a small kick- and the roasted potatoes were perfection. Recommend to ask for the jam for your toast, you won't regret it! It reminded me of a homemade jam from Grandmas garden! Great friendly service, my only complaint is that they only offer their bene on the weekend but that just means I'll have come back on a Saturday or Sunday!", "category": "\nBreakfast & Brunch,\n                    American (Traditional),\n                    Bars\n", "date": "4/27/2018", "alias": "mother-s-bistro-and-bar-portland", "user_id": "SW89d1F2e_CUUdt6pdDrwQ"}, {"id": "bAH1Z1TrXrv0D3X1PmoIkQ", "rating": "2.0", "text": "Ordered: Hail Rosemary Garlic Fries and the Royal Bloody MaryThoughts: Definitely recommend the fries, Bloody was a little spicy for my taste and missing key bloody ingredients: no meat and had to request a pickle spear. Service was poor, asked for a side of ranch ($0.50!!), waited and waited, and had to request a second time before it showed up to our table.", "category": "\nSports Bars,\n                    Burgers,\n                    American (Traditional)\n", "date": "4/26/2018", "alias": "the-independent-sports-bar-and-grill-portland", "user_id": "SW89d1F2e_CUUdt6pdDrwQ"}, {"id": "6Y6zm1088jaUvM_QDmpQrA", "rating": "5.0", "text": "This is such a unique and fun experience. A great opportunity to try different foods- octopus, beef tongue, KOBE BEEF (my personal favorite) but you cook it all yourself, making it a pretty fun experience. Our server Jen was the best!! She was very patient and helpful with our big, maybe a tad unruly, group!", "category": "\nKorean,\n                    Barbeque,\n                    Chicken Wings\n", "date": "3/17/2018", "alias": "ijji-4-reno-5", "user_id": "SW89d1F2e_CUUdt6pdDrwQ"}, {"id": "bfEZA1RsyoK45w5ImRph_Q", "rating": "3.0", "text": "Ordered via Uber eatsCombo plate with rice: so freaking tasty! The only (small) setback was the amount of cilantro which was a little too much for my preferenceVegetable egg roll: delicious all on its own!", "category": "\nVietnamese,\n                    Chinese,\n                    Noodles\n", "date": "2/21/2018", "alias": "tung-kee-m%C3%AC-gia-seattle", "user_id": "SW89d1F2e_CUUdt6pdDrwQ"}, {"id": "YN96J6X3hU4cn743LQYmXA", "rating": "3.0", "text": "Trying Tapas for the first time!  Overall- good but expensive compared to portion sizes Ordered the following (ate alone):Posmo- sweet but not overbearingly sweet!Brussels sprouts- pleasantly surprised by how tasty vegetables can be!! I already like Brussels sprouts but these taste like candy Lamb Meatballs- 1/4lb- normally I like lamb, wasn't a huge fan of it here for some reasonHangar Steak- 1/4lb- probably the best part of the meal, BEWARE: meat was cooked pretty rare but that is how I prefer itFlatbread and Black Garlic aioli- an important add on to the meat, I would have maybe gone with a second sauce to dip", "category": "\nTapas/Small Plates,\n                    Bars\n", "date": "2/21/2018", "alias": "ciudad-seattle-2", "user_id": "SW89d1F2e_CUUdt6pdDrwQ"}, {"id": "Qkw4qN0RwjlqyX6gZVDQQg", "rating": "5.0", "text": "Oatmeal chocolate chip cookies are a must have!! Every Potbelly Sandwich I've had has been delicious. I love the quirky atmosphere here, it's a great sandwich chain and I always make sure to stop in one if I'm nearby.", "category": "\nSandwiches,\n                    Fast Food,\n                    Salad\n", "date": "2/20/2018", "alias": "potbelly-sandwich-shop-seattle-4", "user_id": "SW89d1F2e_CUUdt6pdDrwQ"}]