[{"id": "LsragJA9PLzLuoCJoJtKDg", "rating": "1.0", "text": "I had the displeasure of spending five minutes at New Luck Toy last night. I truly have never witnessed such horrible behavior from a restaurant or bar staff member ever. From reading other reviews this isn't even slightly an isolated incident. And apparently the owner is either clueless or doesn't care. The bartender actually called one member of our group (the birthday girl) an assh*le for asking a question and trying to figure out if we would all fit in the karaoke room, we let him know his behavior was unacceptable and that if anyone was being as a-hole it was him. Obviously at that point we were stunned and turned to leave (this happened so fast that a few members from our group were just arriving). A couple of people from our group are pretty prominent in the restaurant business (owners, and chefs). They mentioned to each other that they were going to call the owner when we got outside. The bartender/ bar manager shouted \"why don't you all call him I don't give a sh*t!\"   As a few in our group hung back to try to make sense of what just happened he said, \"Haven't you left yet?!\"  This is a guy with a personality disorder, in a service position. He could singlehandedly ruin this establishment, and probably will. Understand that we were group of friends (in our 40s and 50s)who had just walked in and were trying to get an idea of how their karaoke room worked. We weren't drunk and we weren't rowdy. We were just asking questions because we didn't know how things worked there. As a business owner I can tell you that the bartender would be unemployed today if he worked for me. There are a lot of people out there who would love to have a job, and would actually be an asset for the business.  On the bright side, we went down the street to Yen Wor Village, where the servers were awesome, the cocktails wonderful, the crowd very full yet very friendly, and the karaoke probably the most fun I've ever seen.", "category": "\nBars,\n                    Chinese,\n                    Karaoke\n", "date": "10/28/2018", "alias": "new-luck-toy-seattle-2", "user_id": "TU3euFeOdrk0E4_woc37fg"}, {"id": "2GyRP___wWSctnwiOXBYew", "rating": "5.0", "text": "I can't say enough great things about Tommy and about Joe's Plumbing.  Tommy came out to fix a host of things a couple of weeks ago.  We had a drain leaking inside the wall between the kitchen sink and the basement below.  In addition we needed a toilet repaired and an antique faucet repaired.  Tommy arrived, on time, and went over the scope of work with me in detail. He told me how much he thought it would cost and how long it would take. Honestly, I didn't think he would be able to get it done that quickly (it required cutting into the back of a cabinet and wall to access the drain pipe), but Tommy was spot-on with his estimate. Furthermore, he went to three places to find the necessary parts for the antique faucet and ended up completely rebuilding the guts of it. It works perfectly now.  The quality of work alone would have been enough to give them a 5-star rating. However, Tommy's incredible positive attitude and general affability made him an pleasure to have in the house, and earns them even more stars (if only that was an option). During a short break, while he was having a glass of water, I learned that Tommy's house had just burned down in the Redding wildfire the night before (he relocated to the Seattle area to work for Joe's and was renting out his house).  And yet there he was, with an amazing attitude, giving the job his full attention and bringing positive energy into our home.  So in addition to providing great plumbing service, Tommy inspired me with his great outlook on life. Way to go Joe's Plumbing for hiring such a great guy to represent your company.  As others have written, Joe's Plumbing is also 2 Sons Co., so when you call them don't be confused.  And do call them.  They're awesome.", "category": "\nPlumbing,\n                    Water Heater Installation/Repair,\n                    Septic Services\n", "date": "8/7/2018", "alias": "joes-plumbing-seattle", "user_id": "TU3euFeOdrk0E4_woc37fg"}, {"id": "mqyUcSBTaPwdSx0LheMslg", "rating": "5.0", "text": "Had dinner at Saltine last night with five friends. Wow!! This is seriously great food in a beautiful but unpretentious space. We tried almost everything on the menu and they were all hits. Started with the fried olives (addictive) and the \"on tap\" cocktails (old fashioned and Negroni). The chef/owner is apparently famous for his Negroni recipe and I can see why. A perfect balance of the ingredients and just the right amount of vermouth.  Collectively we had the crab cake, halibut, risotto, chicken, tomato salad, Saltine salad, arancini, frites and snap peas. The crab cake was probably my favorite. Moist, loaded with crab, great seasoning that didn't overwhelm the crab, and served alongside an awesome herbaceous salad. I wanted to hoard it. But all of the dishes were equally great. The halibut was cooked perfectly (it is so easy to overcook halibut). The curried cauliflower that came with the halibut was reason alone to order it again. I'm going to try to replicate it at home although I'll likely fail. I barely got a taste of the risotto (saffron bliss) and chicken (juicy and perfect) because others were hoarding those. We thought we were too stuffed to eat dessert but because the meal was so good, we ordered one of everything to share. I'm a sucker for anything malted, so the malted milk ice cream with chopped up whoppers was so good!  The olive oil cake was my other favorite. Others at the table liked the pie and the chocolate  pot de créme the best. That means they were all good. The vibe at the restaurant is relaxed, hip (but not obnoxiously so), friendly and food-focused. I don't have a single negative thing to say. I don't even have any suggested improvements. Way to go Saltine!", "category": "\nAmerican (Traditional)\n", "date": "7/22/2018", "alias": "saltine-bellingham", "user_id": "TU3euFeOdrk0E4_woc37fg"}, {"id": "eygNH5Bmc2VRK_inoKQsRA", "rating": "5.0", "text": "I have to add my voice to the chorus.  Shawn at Green Bear is as honest, reliable and skilled as they come.  How I wish all my home projects could go this smoothly.  First of all, he is the only person who returned my call (about repairing or replacing a gas log set in my fireplace).  Ultimately we had him replace our existing (broken) set with a new set that I like so much better.  Replacing a gas log set is a dirty business. But Shawn laid out a drop cloth, kept the mess totally contained and when he was finished, the house was spotless.  On top of that, he is just a great, friendly guy. The total cost was exactly what was quoted. And he even went above and beyond, by painting the back of my fire box so it made the new log set \"pop\".  I hadn't thought of that on my own, and yet it looks so much better now.   Call Shawn - and even if he is scheduled out a ways, wait for him if you can. It is so worth it.", "category": "\nHeating & Air Conditioning/HVAC,\n                    Fireplace Services,\n                    Water Heater Installation/Repair\n", "date": "5/11/2017", "alias": "green-bear-heating-and-air-issaquah-10", "user_id": "TU3euFeOdrk0E4_woc37fg"}, {"id": "DONnVpNsJgLM7OO0paomeg", "rating": "5.0", "text": "These folks are the best, and Crystal (the mechanic that helped us) is fantastic!  I live part time in Pacific City (about 30 minutes from Tillamook) and part time in Seattle. On my last trip down I got a flat the night before I had to head back home.  I chose Tillamook Tire based on the two enthusiastic reviews here. So glad I did. The tire was a gonner, and had to be replaced.  They found a used (virtually new) tire for me, had the tire on my SUV and me back on the road in almost no time!  Total cost: $40, if you can believe it.  Don't be put off by the somewhat sketchy \"old school\" looks of the place.  It is wonderfully authentic and the people are all upbeat and so nice.  I've never seen anyone change a tire as fast as Crystal did.  And she did it with a huge smile on her face and fantastic attitude. I left with a huge smile on my face, having expected a much higher bill (they had me over the barrel, so to speak, since I absolutely needed a tire).  I'm so glad that places like this still exist.", "category": "\nTires\n", "date": "1/4/2017", "alias": "tillamook-tire-serv-tillamook", "user_id": "TU3euFeOdrk0E4_woc37fg"}, {"id": "ZFMYaai5xf7036t5RsUhPA", "rating": "5.0", "text": "Who likes replacing tires? No one.  So to have such a positive experience when I had to replace all four of mine, I was shocked. I called and spoke with Tyler, who gave me options to choose from. He had to order the tires and have them brought in. He told me when they would be in (that afternoon) and said he would call as soon as they arrived. He did exactly that. When I brought in the car I asked how long it would take. He told me \"an hour\". It was done in less.  No up sell, no \"special deals on extended warranties\". Just straight up service. He recommended that I get an alignment at some point and explained why. Made sense and I will do just that.  The entire bill was hundreds less than I expected to pay. And this was for premium tires with a 70K mile warranty.  Tyler was great. Service was great. I'll go back again and again as needed.  Now if they only did body work....", "category": "\nTires,\n                    Auto Repair\n", "date": "6/21/2014", "alias": "point-s-affordable-tire-and-service-seattle-9", "user_id": "TU3euFeOdrk0E4_woc37fg"}]